summary easySr.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Login,50,1168,856,2288,542.85,0.000%,1.99681,5.90,0.80,3023.3
Create Survey,50,893,857,935,15.59,0.000%,2.10979,6.24,0.83,3029.4
See Report,100,892,858,938,13.87,0.000%,4.06207,12.02,1.36,3030.7
Report Data Collection,50,894,856,958,18.26,0.000%,2.10642,6.27,0.78,3047.7
Report Chapter Writing,50,896,855,983,19.26,0.000%,2.10633,6.27,0.78,3049.1
TOTAL,300,939,855,2288,244.53,0.000%,10.13650,30.04,3.72,3035.2
